Iezious/rcjoy/RCJoy/STM32F407DISC_RC_JOY/usb_bsp.c
	//DIR
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_Init(GPIOI, &GPIO_InitStructure);


	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_OTG_HS |
		RCC_AHB1Periph_OTG_HS_ULPI, ENABLE);

#else

#ifdef USE_I2C_PHY    
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);
	/* Configure RESET INTN SCL SDA (Phy/I2C) Pins */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 |
		GPIO_Pin_1 |
		GPIO_Pin_10 |
		GPIO_Pin_11;

	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_Init(GPIOB, &GPIO_InitStructure);

	GPIO_PinAFConfig(GPIOB, GPIO_PinSource0, GPIO_AF_OTG2_FS);
	GPIO_PinAFConfig(GPIOB, GPIO_PinSource1, GPIO_AF_OTG2_FS);
	GPIO_PinAFConfig(GPIOB, GPIO_PinSource10, GPIO_AF_OTG2_FS);
	GPIO_PinAFConfig(GPIOB, GPIO_PinSource11, GPIO_AF_OTG2_FS);
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_OTG_HS, ENABLE);

#else

	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB, ENABLE);

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12 |
		GPIO_Pin_13 |
		GPIO_Pin_14 |
		GPIO_Pin_15;

	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_Init(GPIOB, &GPIO_InitStructure);

	GPIO_PinAFConfig(GPIOB, GPIO_PinSource12, GPIO_AF_OTG2_FS);
	GPIO_PinAFConfig(GPIOB, GPIO_PinSource13, GPIO_AF_OTG2_FS);
	GPIO_PinAFConfig(GPIOB, GPIO_PinSource14, GPIO_AF_OTG2_FS);
	GPIO_PinAFConfig(GPIOB, GPIO_PinSource15, GPIO_AF_OTG2_FS);
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_OTG_HS, ENABLE);
#endif    
#endif
#endif //USB_OTG_HS

	//  
	//  /* Configure pin for overcurrent detection */
	//  RCC_APB2PeriphClockCmd(HOST_OVRCURR_PORT_RCC, ENABLE);
	//  
	//  /* Configure SOF Pin */
	//  GPIO_InitStructure.GPIO_Pin = HOST_OVRCURR_LINE;
	//  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	//  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	//  GPIO_Init(HOST_OVRCURR_PORT, &GPIO_InitStructure);
	//  
	//  /* Connect Button EXTI Line to Button GPIO Pin */
	//  GPIO_EXTILineConfig(HOST_OVRCURR_PORT_SOURCE, HOST_OVRCURR_PIN_SOURCE);  
	//  
	//  /* Configure Button EXTI line */
	//  EXTI_InitStructure.EXTI_Line = HOST_OVRCURR_EXTI_LINE;
	//  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;  
	//  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling; 
	//  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
	//  EXTI_Init(&EXTI_InitStructure);
	USB_OTG_BSP_TimeInit();
}
/**
* @brief  USB_OTG_BSP_EnableInterrupt
*         Configures USB Global interrupt
* @param  None
* @retval None
*/
void USB_OTG_BSP_EnableInterrupt(USB_OTG_CORE_HANDLE *pdev)
{
	NVIC_InitTypeDef NVIC_InitStructure;

	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);
#ifdef USE_USB_OTG_HS   
	NVIC_InitStructure.NVIC_IRQChannel = OTG_HS_IRQn;
#else
	NVIC_InitStructure.NVIC_IRQChannel = OTG_FS_IRQn;
#endif
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	//  
	//  /* Enable the Overcurrent Interrupt */
	//  NVIC_InitStructure.NVIC_IRQChannel = HOST_OVRCURR_IRQn;
	//  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	//  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
	//  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	//  
	//  NVIC_Init(&NVIC_InitStructure);  
}

/**
* @brief  BSP_Drive_VBUS
*         Drives the Vbus signal through IO
* @param  state : VBUS states
* @retval None
*/

void USB_OTG_BSP_DriveVBUS(USB_OTG_CORE_HANDLE *pdev, uint8_t state)
{
	/*
	On-chip 5 V VBUS generation is not supported. For this reason, a charge pump
	or, if 5 V are available on the application board, a basic power switch, must
	be added externally to drive the 5 V VBUS line. The external charge pump can
	be driven by any GPIO output. When the application decides to power on VBUS
	using the chosen GPIO, it must also set the port power bit in the host port
	control and status register (PPWR bit in OTG_FS_HPRT).

	Bit 12 PPWR: Port power
	The application uses this field to control power to this port, and the core
	clears this bit on an overcurrent condition.
	*/
#ifndef USE_USB_OTG_HS   
	if (0 == state)
	{
		/* DISABLE is needed on output of the Power Switch */
		GPIO_SetBits(HOST_POWERSW_PORT, HOST_POWERSW_VBUS);
	}
	else
	{
		/*ENABLE the Power Switch by driving the Enable LOW */
		GPIO_ResetBits(HOST_POWERSW_PORT, HOST_POWERSW_VBUS);
	}
#endif  
}

/**
* @brief  USB_OTG_BSP_ConfigVBUS
*         Configures the IO for the Vbus and OverCurrent
* @param  None
* @retval None
*/

void  USB_OTG_BSP_ConfigVBUS(USB_OTG_CORE_HANDLE *pdev)
{
#ifdef USE_USB_OTG_FS   
	GPIO_InitTypeDef GPIO_InitStructure;

	RCC_AHB1PeriphClockCmd(HOST_POWERSW_PORT_RCC, ENABLE);

	GPIO_InitStructure.GPIO_Pin = HOST_POWERSW_VBUS;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(HOST_POWERSW_PORT, &GPIO_InitStructure);

	/* By Default, DISABLE is needed on output of the Power Switch */
	GPIO_SetBits(HOST_POWERSW_PORT, HOST_POWERSW_VBUS);

	USB_OTG_BSP_mDelay(200);   /* Delay is need for stabilising the Vbus Low
							   in Reset Condition, when Vbus=1 and Reset-button is pressed by user */
#endif  
}

/**
* @brief  USB_OTG_BSP_TimeInit
*         Initializes delay unit using Timer2
* @param  None
* @retval None
*/
static void USB_OTG_BSP_TimeInit(void)
{
#ifdef USE_ACCURATE_TIME   
	NVIC_InitTypeDef NVIC_InitStructure;

	/* Set the Vector Table base address at 0x08000000 */
	NVIC_SetVectorTable(NVIC_VectTab_FLASH, 0x00);

	/* Configure the Priority Group to 2 bits */
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);

	/* Enable the TIM2 gloabal Interrupt */
	NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;

	NVIC_Init(&NVIC_InitStructure);

	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
#endif  
}

/**
* @brief  USB_OTG_BSP_uDelay
*         This function provides delay time in micro sec
* @param  usec : Value of delay required in micro sec
* @retval None
*/
void USB_OTG_BSP_uDelay(const uint32_t usec)
{

#ifdef USE_ACCURATE_TIME    
	BSP_Delay(usec, TIM_USEC_DELAY);
#else
	__IO uint32_t count = 0;
	const uint32_t utime = (120 * usec / 7);
	do
	{
		if (++count > utime)
		{
			return;
		}
	} while (1);
#endif   

