Iezious/rcjoy/RCJoy/STM32F407DISC_RC_JOY/usb_bsp.c
}


/**
* @brief  USB_OTG_BSP_mDelay
*          This function provides delay time in milli sec
* @param  msec : Value of delay required in milli sec
* @retval None
*/
void USB_OTG_BSP_mDelay(const uint32_t msec)
{
#ifdef USE_ACCURATE_TIME  
	BSP_Delay(msec, TIM_MSEC_DELAY);
#else
	USB_OTG_BSP_uDelay(msec * 1000);
#endif    

}


/**
* @brief  USB_OTG_BSP_TimerIRQ
*         Time base IRQ
* @param  None
* @retval None
*/

void USB_OTG_BSP_TimerIRQ(void)
{
#ifdef USE_ACCURATE_TIME 
	if (TIM_GetITStatus(TIM2, TIM_IT_Update) != RESET)
	{
		TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
		if (BSP_delay > 0x00)
		{
			BSP_delay--;
		}
		else
		{
			TIM_Cmd(TIM2, DISABLE);
		}
	}
#endif  
}

#ifdef USE_ACCURATE_TIME 
/**
* @brief  BSP_Delay
*         Delay routine based on TIM2
* @param  nTime : Delay Time
* @param  unit : Delay Time unit : mili sec / micro sec
* @retval None
*/
static void BSP_Delay(uint32_t nTime, uint8_t unit)
{

	BSP_delay = nTime;
	BSP_SetTime(unit);
	while (BSP_delay != 0);
	TIM_Cmd(TIM2, DISABLE);
}

/**
* @brief  BSP_SetTime
*         Configures TIM2 for delay routine based on TIM2
* @param  unit : msec /usec
* @retval None
*/
static void BSP_SetTime(uint8_t unit)
{
	TIM_TimeBaseInitTypeDef  TIM_TimeBaseStructure;

	TIM_Cmd(TIM2, DISABLE);
	TIM_ITConfig(TIM2, TIM_IT_Update, DISABLE);


	if (unit == TIM_USEC_DELAY)
	{
		TIM_TimeBaseStructure.TIM_Period = 11;
	}
	else if (unit == TIM_MSEC_DELAY)
	{
		TIM_TimeBaseStructure.TIM_Period = 11999;
	}
	TIM_TimeBaseStructure.TIM_Prescaler = 5;
	TIM_TimeBaseStructure.TIM_ClockDivision = 0;
	TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;

	TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);
	TIM_ClearITPendingBit(TIM2, TIM_IT_Update);

	TIM_ARRPreloadConfig(TIM2, ENABLE);

	/* TIM IT enable */
	TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);

	/* TIM2 enable counter */
	TIM_Cmd(TIM2, ENABLE);
}

#endif

/**
* @}
*/

/**
* @}
*/

/**
* @}
*/

/******************* (C) COPYRIGHT 2011 STMicroelectronics *****END OF FILE****/

#endif